In [1]:
import pandas as pd
import numpy as np

In [2]:
"""
Dropping one or more entries from an axis is easy if you already have an index array or list without those entries. As that can 
require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted
from an axis
"""

names = pd.Series(['Anshu', 'Sneha', 'Samiksha', 'Shreya', 'Palak'], index = [1, 2, 3, 4, 5])

In [3]:
names

1       Anshu
2       Sneha
3    Samiksha
4      Shreya
5       Palak
dtype: object

In [4]:
new_names = names.drop(5)

In [5]:
new_names

1       Anshu
2       Sneha
3    Samiksha
4      Shreya
dtype: object

In [6]:
names.drop([4, 5])

1       Anshu
2       Sneha
3    Samiksha
dtype: object

In [7]:
# With DataFrame, index values can be deleted from either axis. To illustrate this, we first create an example DataFrame.

data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Uttarakhand', 'Himachal Pradesh', 'Haryana', 'Chandigarh'],
                   columns = ['One', 'Two', 'Three', 'Four'])

In [8]:
data

                  One  Two  Three  Four
Uttarakhand         0    1      2     3
Himachal Pradesh    4    5      6     7
Haryana             8    9     10    11
Chandigarh         12   13     14    15

In [9]:
# Calling drop with a sequence of labels will drop values from the row labels (axis = 0)

data.drop(['Himachal Pradesh', 'Uttarakhand'])

            One  Two  Three  Four
Haryana       8    9     10    11
Chandigarh   12   13     14    15

In [10]:
# You can drop values from columns by passing axis = 1 or axis = 'columns':

data.drop('Two', axis = 1)

                  One  Three  Four
Uttarakhand         0      2     3
Himachal Pradesh    4      6     7
Haryana             8     10    11
Chandigarh         12     14    15

In [11]:
data.drop(['Two', 'Four'], axis = 'columns')

                  One  Three
Uttarakhand         0      2
Himachal Pradesh    4      6
Haryana             8     10
Chandigarh         12     14

In [12]:
"""
Many functions, like drop, which modify the size of a series or DataFrame, can manipulate an object inplace without returning
a new object
"""

names.drop(3, inplace = True)

In [13]:
names

1     Anshu
2     Sneha
4    Shreya
5     Palak
dtype: object

In [ ]:
# Be careful with the inplace, as it destroys any data that is dropped